-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        10.6.8-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  11.3.0.6295
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


-- board 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `board` /*!40100 DEFAULT CHARACTER SET latin1 */;
USE `board`;

-- 테이블 board.board 구조 내보내기
CREATE TABLE IF NOT EXISTS `board` (
  `boardid` int(11) NOT NULL AUTO_INCREMENT COMMENT '게시글 번호',
  `title` varchar(45) NOT NULL,
  `content` mediumtext NOT NULL,
  PRIMARY KEY (`boardid`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=134 DEFAULT CHARSET=utf8mb3;

-- 테이블 데이터 board.board:~128 rows (대략적) 내보내기
DELETE FROM `board`;
/*!40000 ALTER TABLE `board` DISABLE KEYS */;
INSERT INTO `board` (`boardid`, `title`, `content`) VALUES
	(5, '제목ffff', '내fffff'),
	(7, '제목4', '내용4'),
	(8, '제목5', '내용5'),
	(9, '제목6', '내용6'),
	(10, '제목7', '내용7'),
	(11, '제목8', '내용8'),
	(12, '제목9', '내용9'),
	(13, '제목10', '내용10'),
	(14, '제목11', '내용11'),
	(15, '제목12', '내용12'),
	(16, '제목13', '내용13'),
	(17, '제목14', '내용14'),
	(18, '제목15', '내용15'),
	(19, '제목16', '내용16'),
	(20, '제목17', '내용17'),
	(21, '제목18', '내용18'),
	(22, '제목19', '내용19'),
	(23, '제목20', '내용20'),
	(24, '제목21', '내용21'),
	(25, '제목22', '내용22'),
	(26, '제목23', '내용23'),
	(27, '제목24', '내용24'),
	(28, '제목25', '내용25'),
	(29, '제목26', '내용26'),
	(30, '제목27', '내용27'),
	(31, '제목28', '내용28'),
	(32, '제목29', '내용29'),
	(33, '제목30', '내용30'),
	(34, '제목31', '내용31'),
	(35, '제목32', '내용32'),
	(36, '제목33', '내용33'),
	(37, '제목34', '내용34'),
	(38, '제목35', '내용35'),
	(39, '제목36', '내용36'),
	(40, '제목37', '내용37'),
	(41, '제목38', '내용38'),
	(42, '제목39', '내용39'),
	(43, '제목40', '내용40'),
	(44, '제목41', '내용41'),
	(45, '제목42', '내용42'),
	(46, '제목43', '내용43'),
	(47, '제목44', '내용44'),
	(48, '제목45', '내용45'),
	(49, '제목46', '내용46'),
	(50, '제목47', '내용47'),
	(51, '제목48', '내용48'),
	(52, '제목49', '내용49'),
	(53, '제목50', '내용50'),
	(54, '제목51', '내용51'),
	(55, '제목52', '내용52'),
	(56, '제목53', '내용53'),
	(57, '제목54', '내용54'),
	(58, '제목55', '내용55'),
	(59, '제목56', '내용56'),
	(60, '제목57', '내용57'),
	(61, '제목58', '내용58'),
	(62, '제목59', '내용59'),
	(63, '제목60', '내용60'),
	(64, '제목61', '내용61'),
	(65, '제목62', '내용62'),
	(66, '제목63', '내용63'),
	(67, '제목64', '내용64'),
	(68, '제목65', '내용65'),
	(69, '제목66', '내용66'),
	(70, '제목67', '내용67'),
	(71, '제목68', '내용68'),
	(72, '제목69', '내용69'),
	(73, '제목70', '내용70'),
	(74, '제목71', '내용71'),
	(75, '제목72', '내용72'),
	(76, '제목73', '내용73'),
	(77, '제목74', '내용74'),
	(78, '제목75', '내용75'),
	(79, '제목76', '내용76'),
	(80, '제목77', '내용77'),
	(81, '제목78', '내용78'),
	(82, '제목79', '내용79'),
	(83, '제목80', '내용80'),
	(84, '제목81', '내용81'),
	(85, '제목82', '내용82'),
	(86, '제목83', '내용83'),
	(87, '제목84', '내용84'),
	(88, '제목85', '내용85'),
	(89, '제목86', '내용86'),
	(90, '제목87', '내용87'),
	(91, '제목88', '내용88'),
	(92, '제목89', '내용89'),
	(93, '제목90', '내용90'),
	(94, '제목91', '내용91'),
	(95, '제목92', '내용92'),
	(96, '제목93', '내용93'),
	(97, '제목94', '내용94'),
	(98, '제목95', '내용95'),
	(99, '제목96', '내용96'),
	(100, '제목97', '내용97'),
	(101, '제목98', '내용98'),
	(102, '제목99', '내용99'),
	(103, '제목100', '내용100'),
	(104, '제목101', '내용101'),
	(105, '제목102', '내용102'),
	(106, '제목103', '내용103'),
	(107, '제목104', '내용104'),
	(108, '제목105', '내용105'),
	(109, '제목106', '내용106'),
	(110, '제목107', '내용107'),
	(111, '제목108', '내용108'),
	(112, '제목109', '내용109'),
	(113, '제목110', '내용110'),
	(114, '제목111', '내용111'),
	(115, '제목112', '내용112'),
	(116, '제목113', '내용113'),
	(117, '제목114', '내용114'),
	(118, '제목115', '내용115'),
	(119, '제목116', '내용116'),
	(120, '제목117', '내용117'),
	(121, '제목118', '내용118'),
	(122, '제목119', '내용119'),
	(123, '제목120', '내용120'),
	(124, '안녕', '웅'),
	(125, '게시글작성', '작성'),
	(126, '게시글작성', '작성'),
	(127, 'd', 'd'),
	(128, 's', 's'),
	(129, 'g', 'g'),
	(130, 'c', 'c'),
	(131, 'gg', 'gg'),
	(132, 'h', 'h'),
	(133, 't', 't');
/*!40000 ALTER TABLE `board` ENABLE KEYS */;

-- 프로시저 board.testDataInsert 구조 내보내기
DELIMITER //
CREATE PROCEDURE `testDataInsert`()
BEGIN
    DECLARE i INT DEFAULT 1;

    WHILE i <= 120 DO
        INSERT INTO board(title, content)
          VALUES(concat('제목',i), concat('내용',i));
        SET i = i + 1;
    END WHILE;
END//
DELIMITER ;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
