lock = """
/-----------------------------/
/   비밀번호를 입력해주세요.   /                   
/      ----------------       /              
/      /              /       /
/      ----------------       /
/-----------------------------/
"""
unlock = """
/-----------------------------/
/       비밀번호 해제완료      /                   
/      ----------------       /              
/      /     !>__</    /       /
/      ----------------       /
/-----------------------------/
"""

wrong_passward = """
/-----------------------------/
/비밀번호를  다시 입력해주세요./                   
/      ----------------       /              
/      /              /       /
/      ----------------       /
/-----------------------------/
"""

alarm = """
/-----------------------------/
/        비밀번호 오류         /                   
/      ----------------       /              
/      /     lock     /       /
/      ----------------       /
/-----------------------------/
"""

password = "A1234!"
print(lock)
user_input = input("")
#추가완료 - 비밀번호 최대 5회까지 재입력 가능. 이후에는 잠가버림.
count = 1

#추가완료 - 비밀번호 잘못 입력시 재입력 요청
while user_input != password:
    while 1<= count <5:
        print(f"{count}회 잘못입력하였습니다.")
        print(wrong_passward)
        user_input = input("")
        count += 1
        if user_input == password:
             print("잠금이 해제되었습니다.")
             print(unlock)
             count += 5
    
        
    if count == 5:
         print("경고! 비밀번호를 5회 잘못 입력하셨습니다.")
         print(alarm)
         break
    break

if user_input == password:
     print("잠금이 해제되었습니다.")
     print(unlock)             


